import React from 'react';
import s from './PrivacyPolicyContent.module.scss';
import { Typography } from '@/shared/ui/typography';

export const PrivacyPolicyContent = () => {
  return (
    <div className={s.content}>
      <Typography variant="h1">Политика конфиденциальности</Typography>
      <div className={s.content}>
        <div className={s.elem}>
          <Typography variant="h3">1. Общие положения</Typography>
          <div>
            <Typography variant="body_2">
              Настоящая политика обработки персональных данных составлена
              в соответствии с требованиями Федерального закона от 27.07.2006.
              № 152-ФЗ «О персональных данных» (далее — Закон о персональных
              данных) и определяет порядок обработки персональных данных и меры
              по обеспечению безопасности персональных данных, предпринимаемые
              ИП Рязанцева Ирина Анатольевна (далее — Оператор).
            </Typography>
            <ul>
              <Typography as="li" variant="body_2">
                1.1. Оператор ставит своей важнейшей целью и условием
                осуществления своей деятельности соблюдение прав и свобод
                человека и гражданина при обработке его персональных данных,
                в том числе защиты прав на неприкосновенность частной жизни,
                личную и семейную тайну.
              </Typography>
              <Typography as="li" variant="body_2">
                1.2. Настоящая политика Оператора в отношении обработки
                персональных данных (далее — Политика) применяется ко всей
                информации, которую Оператор может получить о посетителях
                веб-сайта https://autoparts.ru.
              </Typography>
            </ul>
          </div>
        </div>
        <div className={s.elem}>
          <Typography variant="h3">
            2. Основные понятия, используемые в Политике
          </Typography>
          <div>
            <ul>
              <Typography as="li" variant="body_2">
                2.1. Автоматизированная обработка персональных данных —
                обработка персональных данных с помощью средств вычислительной
                техники.
              </Typography>
              <Typography as="li" variant="body_2">
                2.2. Блокирование персональных данных — временное прекращение
                обработки персональных данных (за исключением случаев, если
                обработка необходима для уточнения персональных данных).
              </Typography>
              <Typography as="li" variant="body_2">
                2.3. Веб-сайт — совокупность графических и информационных
                материалов, а также программ для ЭВМ и баз данных,
                обеспечивающих их доступность в сети интернет по сетевому адресу
                https://autoparts.ru.
              </Typography>
              <Typography as="li" variant="body_2">
                2.4. Информационная система персональных данных — совокупность
                содержащихся в базах данных персональных данных и обеспечивающих
                их обработку информационных технологий и технических средств.
              </Typography>
              <Typography as="li" variant="body_2">
                2.5. Обезличивание персональных данных — действия, в результате
                которых невозможно определить без использования дополнительной
                информации принадлежность персональных данных конкретному
                Пользователю или иному субъекту персональных данных.
              </Typography>
              <Typography as="li" variant="body_2">
                2.6. Обработка персональных данных — любое действие (операция)
                или совокупность действий (операций), совершаемых
                с использованием средств автоматизации или без использования
                таких средств с персональными данными, включая сбор, запись,
                систематизацию, накопление, хранение, уточнение (обновление,
                изменение), извлечение, использование, передачу
                (распространение, предоставление, доступ), обезличивание,
                блокирование, удаление, уничтожение персональных данных.
              </Typography>
              <Typography as="li" variant="body_2">
                2.7. Оператор — государственный орган, муниципальный орган,
                юридическое или физическое лицо, самостоятельно или совместно
                с другими лицами организующие и/или осуществляющие обработку
                персональных данных, а также определяющие цели обработки
                персональных данных, состав персональных данных, подлежащих
                обработке, действия (операции), совершаемые с персональными
                данными.
              </Typography>
              <Typography as="li" variant="body_2">
                2.8. Персональные данные — любая информация, относящаяся прямо
                или косвенно к определенному или определяемому Пользователю
                веб-сайта https://autoparts.ru.
              </Typography>
              <Typography as="li" variant="body_2">
                2.9. Персональные данные, разрешенные субъектом персональных
                данных для распространения, — персональные данные, доступ
                неограниченного круга лиц к которым предоставлен субъектом
                персональных данных путем дачи согласия на обработку
                персональных данных, разрешенных субъектом персональных данных
                для распространения в порядке, предусмотренном Законом
                о персональных данных (далее — персональные данные, разрешенные
                для распространения).
              </Typography>
              <Typography as="li" variant="body_2">
                2.10. Пользователь — любой посетитель веб-сайта
                https://autoparts.ru.
              </Typography>
              <Typography as="li" variant="body_2">
                2.11. Предоставление персональных данных — действия,
                направленные на раскрытие персональных данных определенному лицу
                или определенному кругу лиц.
              </Typography>
              <Typography as="li" variant="body_2">
                2.12. Распространение персональных данных — любые действия,
                направленные на раскрытие персональных данных неопределенному
                кругу лиц (передача персональных данных) или на ознакомление
                с персональными данными неограниченного круга лиц, в том числе
                обнародование персональных данных в средствах массовой
                информации, размещение в информационно-телекоммуникационных
                сетях или предоставление доступа к персональным данным
                каким-либо иным способом.
              </Typography>
              <Typography as="li" variant="body_2">
                2.13. Трансграничная передача персональных данных — передача
                персональных данных на территорию иностранного государства
                органу власти иностранного государства, иностранному физическому
                или иностранному юридическому лицу.
              </Typography>
              <Typography as="li" variant="body_2">
                2.14. Уничтожение персональных данных — любые действия,
                в результате которых персональные данные уничтожаются
                безвозвратно с невозможностью дальнейшего восстановления
                содержания персональн
              </Typography>
            </ul>
          </div>
        </div>
      </div>
    </div>
  );
};
